Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Since these must match up to the GuiControl and NotifyCode used to register the callback, they are rarely useful to the script.
ja: これらはコールバックの登録に使用したGuiControlと NotifyCodeと一致する必要があるため、スクリプトに役立つことはほとんどない。

source: Since this behavior is counterintuitive, it might change in a future release.
ja: この動作は直感に反しているため、将来のリリースで変更される可能性があります。

source: Since this cached binary number is the only means of detecting the type of value, caching performed internally by expressions like var+1 or abs(var) effectively changes the "type" of var as a side-effect.
ja: このキャッシュされた2進数が値の型を検出する唯一の手段であるため、var+1や abs(var)などの式で内部的に行われるキャッシュは、副作用としてvarの「型」を効果的に変更します。

source: Since this function is often called simply to ensure the variable has a certain minimum capacity, for performance reasons, it shrinks the variable only when RequestedCapacity is 0.
ja: この関数は、単に変数の最小容量を確保するために呼ばれることが多いので、パフォーマンス上の理由から、RequestedCapacityが0のときだけ変数を縮小する。

source: Since this function only checks for the existence of a folder, "D" is always present in the return value.
ja: この関数は、フォルダの存在を確認するだけなので、戻り値には必ず「D」が含まれる。

source: Since this parameter is an expression, all of the following are valid examples:
ja: このパラメータは式であるため、以下はすべて有効な例であります：

source: Since this parameter is an expression, all of the following lines are valid:
ja: このパラメーターはexpressionなので、以下の行はすべて有効です：

source: Since this value tends to increase by increments of 10, do not check whether it is equal to another value.
ja: この値は10刻みで増加する傾向があるため、他の値と等しいかどうかはチェックしない。

source: Since variables in AutoHotkey have no fixed type, the address passed to the function points to temporary memory rather than the caller's variable.
ja: AutoHotkeyの変数には固定型がないため、関数に渡されるアドレスは、呼び出し元の変数ではなく、一時メモリを指しています。

source: Since you're viewing this documentation locally, you've probably already installed AutoHotkey and can skip to section b.
ja: このドキュメントはローカルでご覧になっているのであれば、おそらくAutoHotkeyはすでにインストールされているでしょうから、セクションbまでは読み飛ばすことができます。

source: Single character time marker, such as A or P (depends on locale)
ja: AやPなどの1文字の午前午後を表す記号（ロケールによります）

source: Single-character accelerators with no modifiers are case-sensitive and can be triggered by unusual means such as IME or Alt+NNNN.
ja: 修飾語のない1文字のアクセラレータは大文字と小文字を区別し、IMEやAlt+NNNNなど通常とは異なる手段でトリガーすることができます。

source: Single-line comments require a leading space if they are not at the start of the line.
ja: 1行のコメントは、行頭でない場合、先頭のスペースが必要です。

source: Single-quote marks (') and double-quote marks (") function identically, except that a string enclosed in single-quote marks can contain literal double-quote marks and vice versa.
ja: シングルクオートマーク（'）とダブルクオートマーク（"）は、シングルクオートマークで囲まれた文字列がリテラルダブルクオートマークを含むことができ、その逆も可能であることを除いて、同じように機能します。

source: Six attempts will be made to activate the target window over the course of 60 ms.
ja: 60ミリ秒の間に6回、ターゲットウィンドウの活性化を試みる。

source: Size (in points).
ja: サイズ（単位：ポイント）。

source: Size calculation for structures containing one or more pointers.
ja: 1つ以上のポインタを含む構造体のサイズを計算します。

source: Skips the dialog box and replaces the old instance automatically.
ja: ダイアログボックスをスキップして、古いインスタンスを自動的に置き換えます。

source: Skips the gentle method of activating a window and goes straight to the forceful method.
ja: ウィンドウをアクティブにする穏やかな方法をスキップして、強引な方法へと直行します。

source: Skips the rest of a loop statement's current iteration and begins a new one.
ja: ループ文の現在の繰り返しの残りをスキップして、新しい繰り返しを開始します。

source: Sleep - Syntax & Usage | AutoHotkey v2
ja: Sleep - 構文と使用法｜AutoHotkey v2

source: Sleep 10 ; Try various milliseconds.
ja: Sleep 10 ; 様々なミリ秒を試してみてください。

source: Sleep 1000 ; If successful, the reload will close this instance during the Sleep, so the line below will never be reached.
ja: Sleep 1000 ; 成功したときは、reload関数はこのインスタンスをSleep関数の実行中に閉じ、以下の行は実行されません。

source: Sleep 500 ; It's quite sensitive to this value; altering it may change the behavior in unexpected ways.
ja: Sleep 500 ; この値にはかなり敏感で、変更すると予期せぬ形で動作が変化する可能性があります。

source: Sleep 500 ; Wait a bit for Ctrl+V to be processed
ja: Sleep 500 ; Ctrl+V が処理されるまで少し待つ。

source: Slider Control Styles
ja: Sliderコントロールのスタイル

source: Slider's Change event is raised more consistently than the v1 g-label; i.e. it no longer ignores changes made by the mouse wheel by default.
ja: スライダーの Change イベントは、v1 g-label よりも一貫して発生します。つまり、デフォルトでマウスホイールによる変更を無視することはなくなります。

source: Slight distortion may occur when loading tray icons from file types other than .ICO.
ja: .ICO以外のファイル形式からトレイアイコンを読み込むと、わずかな歪みが発生する場合があります。

source: Small
ja: 小さい

source: Small code (25 lines or less) will probably be fine to read without indentation, but it'll soon get sloppy.
ja: 小さなコード（25行以下）は、インデントなしで読む分には問題ないだろうが、すぐにだらしなくなってしまう。

source: Small icons typically appear in window captions and in small icon view.
ja: 小さなアイコンは通常、ウィンドウのキャプションや小さなアイコン表示に表示される。

source: Smaller types are padded out to 32 bits, while larger types are split into a series of 32-bit parameters.
ja: 小さな型は32ビットにパディングされ、大きな型は32ビットの一連のパラメータに分割されます。

source: Smaller types are padded out to 64 bits, while larger types are always passed by address.
ja: 小さい型は64ビットにパディングされ、大きい型は常にアドレスで渡されます。

source: Smart LTrim: The default behaviour is to count the number of leading spaces or tabs on the first line below the continuation section options, and remove that many spaces or tabs from each line thereafter.
ja: 賢いLTrim：デフォルトの動作は、継続セクションオプション以下の最初の行の先頭のスペースまたはタブの数を数え、それ以降の各行からその数のスペースまたはタブを削除することです。

source: Smart auto-indent
ja: スマートな自動インデント

source: SmartScreen
ja: スマートスクリーン

source: So I'll set it clear:
ja: だから、はっきりさせておこう：

source: So I'll set it clear: AutoHotkey has the ability to have as many hotkeys and hotstrings in one file as you want.
ja: だから、はっきりさせておこう：AutoHotkeyには、1つのファイルにいくつでもホットキーやホットストリングを設定できる機能があります。

source: So another way to avoid issues with slashes is to quote the spaces instead of the entire parameter, or end the quote before the slash, as in Run 'my.exe "A"\ B'.
ja: そこで、スラッシュの問題を回避する別の方法として、Run 'my.exe "A"\ B'のように、パラメータ全体ではなくスペースを引用するか、スラッシュの前で引用を終了します。

source: So for example, 54 and "530" are compared numerically, while "54" and "530" are compared alphabetically.
ja: そのため、例えば54と "530"は数字で比較され、"54"と "530"はアルファベットで比較されます。

source: So how do we include a literal quote mark within the command line, rather than having it end the command line?
ja: では、コマンドラインを終了させるのではなく、コマンドライン内にリテラルな引用符を入れるにはどうすればよいのでしょうか？

source: So if after reading the above you've not made heads or tails of it, please forget it.
ja: だから、上記を読んでもさっぱり理解できないなら、もう忘れてほしい。

source: So if the target user has done any of this then your script will fail at that point.
ja: そのため、ターゲット・ユーザーがこのいずれかを行った場合、スクリプトはその時点で失敗する。

source: So in this case, the Run function needs a bit of help, in any or all of the following forms:
ja: そこで、この場合、Run関数には、次のような形で、ちょっとした手助けが必要です：

source: So instead use DateDiff to find out whether the amount of time between them is positive or negative.
ja: そこで、代わりにDateDiffを使って、その間の時間量が正か負かを調べます。

source: So it won't be covered in the tutorial, at least, not right now.
ja: だからチュートリアルでは扱わないことにしています。

source: So most scripts should leave this setting turned off.
ja: そのため、ほとんどのスクリプトはこの設定をオフのままにしておく必要があります。

source: So no need for a bunch of Send functions with one letter each.
ja: だから、1文字ずつのSend関数の束は必要ない。

source: So now that you have created a script, we need to add stuff into the file.
ja: さて、スクリプトを作成したところで、そのファイルにコードを記述する必要があります。

source: So now you decided that you want to send (type) keys to a program.
ja: さて、あなたは今、プログラムにキーを送信（タイプ）したいと決めた。

source: So please remember to check the table on the Send page and make sure you have your brackets in the right places.
ja: ですから、送信ページの表をチェックし、括弧が正しい位置にあることを確認するのを忘れないでください。

source: So thanks to Jon and the other AutoIt authors for those as well.
ja: だから、Jonと他のAutoItの著者にも感謝しています。

source: So try ALL of these before giving up.
ja: だから、あきらめる前にこれらすべてを試してみてほしい。

source: So try all of these before giving up.
ja: だから、あきらめる前にこれらすべてを試してみてほしい。

source: So we either open Notepad or activate Notepad depending on whether it is already running.
ja: そこで、メモ帳を開くか、メモ帳を起動するかは、すでに起動しているかどうかで判断しています。

source: So we will need to tell it what to do.
ja: だから、何をすべきかを指示する必要があります。

source: So you could simply do this if you wanted:
ja: だから、やろうと思えば簡単にできる：

source: So, for example, the two statements below have the combined effect of enabling all warnings except LocalSameAsGlobal:
ja: したがって、例えば、以下の2つのステートメントは、LocalSameAsGlobal以外のすべての警告を有効にする効果を合わせ持っています：

source: Software License
ja: ソフトウェアライセンス

source: Software License:
ja: ソフトウェアライセンス

source: Software License: GNU General Public License
ja: ソフトウェアライセンス：GNU一般公衆ライセンス

source: Some Transform sub-commands are altered or unavailable:
ja: Transformのサブコマンドの一部が変更されたり、使用できなくなったりします：

source: Some COM methods may require specific types of values which have no direct equivalent within AutoHotkey.
ja: COMのメソッドの中には、AutoHotkey内で直接同等のものがない、特定のタイプの値を必要とするものがあります。

source: Some COM objects which represent arrays or collections do not expose a default property, so items cannot be accessed with [] in v2.
ja: 配列やコレクションを表すCOMオブジェクトの中には、デフォルトのプロパティを公開していないものがあるため、v2では[]でアイテムにアクセスすることができません。

source: Some UIs or "clients" known to be compatible with AutoHotkey are listed on this page:
ja: AutoHotkeyと互換性があることが知られているいくつかの UI または「クライアント」は、このページにリストされています：

source: Some applications (e.g. Calc.exe) do not obey the requested startup state and thus Max/Min/Hide will have no effect.
ja: 一部のアプリケーション（Calc.exeなど）は、要求されたスタートアップ状態に従わないため、Max/Min/Hideは効果を発揮しないことがあります。

source: Some applications and games may have trouble tracking the mouse if it moves too quickly.
ja: アプリケーションやゲームによっては、マウスの動きが速いと追従できないことがあります。

source: Some applications do not obey a ClickCount higher than 1 for the mouse wheel.
ja: アプリケーションによっては、マウスホイールのClickCountが1以上でないと従わないものがあります。

source: Some applications keep the clipboard open for long periods of time, perhaps to write or read large amounts of data.
ja: アプリケーションによっては、大量のデータを書き込んだり読み込んだりするために、クリップボードを長時間開いたままにしておくことがあります。

source: Some applications store their ListView text privately, which prevents their text from being retrieved.
ja: アプリケーションによっては、ListViewのテキストを非公開で保存し、そのテキストを取得できないようにしているものもあります。

source: Some applications store their item data privately, which prevents their text from being retrieved.
ja: アプリケーションによっては、アイテムデータを非公開で保存し、そのテキストを取得できないようにしているものもあります。

source: Some built-in functions accept a Buffer object in place of an address - see the Related section for links.
ja: 一部の組み込み関数では、アドレスの代わりにBufferオブジェクトを受け付けます - リンクについては関連セクションを参照してください。

source: Some built-in objects returned z, some returned x.y (such as c := GuiObj.BackColor := "red" setting c to 0xFF0000), and some returned an incorrect value.
ja: 組み込みオブジェクトの中にはzを返すもの、x.yを返すもの（c := GuiObj.BackColor := "red"でcを 0xFF0000に設定するなど）、不正確な値を返すものがありました。

source: Some cases where this function might be needed (if it is intended to stay running when there are no running threads or hotkeys, timers, etc.) include:
ja: この機能が必要となるケース（実行中のスレッドやホットキー、タイマーなどがないときに実行し続けることを意図している場合）には、以下のようなものがあります：

source: Some class names include digits which are not part of the control's sequence number.
ja: クラス名の中には、コントロールのシーケンス番号に含まれない数字が含まれているものがあります。

source: Some common errors, such as typos and missing "global" declarations, can be detected by enabling warnings.
ja: タイプミスや「グローバル」宣言の欠落など、よくあるエラーのいくつかは、警告を有効にすることで検出できる。

source: Some common rules apply to this parameter across all methods which use it:
ja: このパラメータを使用するすべてのメソッドで、いくつかの共通のルールが適用されます：

source: Some configurations of Windows IME (such as Japanese input with English keyboard) use CapsLock to toggle between modes.
ja: Windows IMEの一部の構成（英語キーボードで日本語入力など）では、CapsLockを使用してモードを切り替えます。

source: Some controls had no visible text, or did not support retrieving it, so completely ignored the fourth parameter.
ja: コントロールによっては、テキストが表示されていなかったり、テキストの取得をサポートしていなかったりするため、4番目のパラメータを完全に無視することができました。

source: Some elements of the path which would normally be removed or altered by normalization instead become part of the file's actual path.
ja: 通常、正規化によって削除または変更されるパスの一部の要素は、代わりにファイルの実際のパスの一部になります。

source: Some error messages have been changed.
ja: 一部のエラーメッセージが変更されました。

source: Some errors are detected at load-time, and must be corrected before the script will run at all.
ja: 一部のエラーはロードタイムに検出され、スクリプトを実行する前に修正する必要があります。

source: Some examples:
ja: いくつかの例を挙げよう：

source: Some extended styles introduced in Windows XP or later versions are not listed here.
ja: Windows XPまたはそれ以降のバージョンで導入された一部の拡張スタイルは、ここに記載されていません。

source: Some functions might do no more than perform a simple calculation, while others have immediately visible effects, such as moving a window.
ja: 単純な計算を行うだけの関数もあれば、ウィンドウを移動させるなど、すぐに目に見える効果を持つ関数もあります。

source: Some keyboard layouts do not define a 1:1 mapping of virtual key codes to scan codes.
ja: キーボードレイアウトによっては、仮想キーコードとスキャンコードの1：1マッピングが定義されていないものがあります。

source: Some keys do not generate events and thus will not be visible here.
ja: 一部のキーはイベントが発生しないため、ここでは表示されません。

source: Some mice have a single wheel which can be scrolled up and down or tilted left and right.
ja: マウスによっては、ホイールが1つで、上下スクロールや左右に傾けることができるものもあります。

source: Some names were more commonly used with specific types of parameters, such as ComObjActive(CLSID), ComObjParameter(vt, value), ComObjEnwrap(dsp).
ja: ComObjActive(CLSID),ComObjParameter(vt, value),ComObjEnwrap(dsp)のように、特定の種類のパラメータでよく使われる名前もありました。

source: Some of the common patterns it may find include:
ja: よくあるパターンとしては、以下のようなものがある：

source: Some of the conditions above are detected in v1, but not mid-expression; for instance, A_AhkPath := x is detected in v1 but y := x, A_AhkPath := x is only detected in v2.
ja: 上記の条件の中には、v1では検出されるが、表現の途中では検出されないものがある。例えば、A_AhkPath := xは、v1で検出されるが、y := x, A_AhkPath := xは、v2でのみ検出されます。

source: Some of the easiest keys to reach on the keyboard are also the least frequently used.
ja: キーボードで最も届きやすいキーは、最も使用頻度の低いキーでもあります。

source: Some of the examples below will use numbered hotkeys like ^1:: (Ctrl and a number, so you can try multiple examples at once if there are no duplicates), but you can change that to whatever suits you.
ja: 以下のいくつかの例では、^1::（Ctrlと数字、重複がなければ一度に複数の例を試すことができます）のような番号付きのホットキーを使用しますが、あなたの好みに合わせて変更することができます。

source: Some of the features are:
ja: いくつかの特徴を挙げよう：

source: Some of the following methods are defined by the prototype of the appropriate class, or the Gui.List base class.
ja: 以下のメソッドの一部は、該当するクラスのプロトタイプ、またはGui.Listの基底クラスで定義されます。

source: Some of the most useful hotkeys for the mouse wheel involve alternate modes of scrolling a window's text.
ja: マウスホイールを使った便利なホットキーの中には、ウィンドウのテキストをスクロールさせる別のモードがあります。

source: Some of these strings can be used with DirSelect and Run.
ja: これらの文字列のいくつかは、DirSelectや Runで使うことができる。

source: Some of these strings can be used with DirSelect.
ja: これらの文字列のいくつかは、DirSelectで使うことができる。

source: Some older versions of AutoHotkey_L used 1.0.* version numbers, so for clarity, this document refers to the two branches of AutoHotkey by name rather than version number.
ja: AutoHotkey_Lの古いバージョンでは1.0.*のバージョン番号が使われているものもあるので、わかりやすくするために、このドキュメントではバージョン番号ではなく名前でAutoHotkeyの2つのブランチを参照しています。

source: Some other related concepts:
ja: その他、関連する概念もあります：

source: Some parameters can be omitted, in which case the parameter can be left blank, but the comma following it can only be omitted if all remaining parameters are also omitted.
ja: 一部のパラメータは省略可能で、その場合はパラメータを空白にすることができますが、それに続くカンマは、残りのすべてのパラメータも省略される場合にのみ省略することができます。

source: Some programs have their paths registered with the system, in which case you can get away with just passing the filename of the program, with or (sometimes) without the ".exe" extension.
ja: プログラムによってはパスがシステムに登録されているものもあり、その場合は拡張子「.exe」の有無にかかわらず、プログラムのファイル名だけを渡すことで対応できます（場合によっては拡張子「.exe」のないものもあります）。

source: Some programs need to be started in their own directories (when in doubt, it is usually best to do so).
ja: プログラムによっては、独自のディレクトリで起動する必要があります（疑わしい場合は、通常、そうするのが最善です）。

source: Some programs or games might require a key to be sent repeatedly (as though you are holding it down on the keyboard).
ja: プログラムやゲームによっては、（キーボードを押し続けているように）キーを繰り返し送信する必要がある場合があります。

source: Some programs use their own status bars or special versions of the MS common control, in which case such bars are not supported.
ja: プログラムによっては、独自のステータス・バーやMSコモン・コントロールの特別なバージョンを使用するものがあり、その場合はそのようなバーはサポートされない。

source: Some programs use their own status bars or special versions of the MS common control, in which case the text cannot be retrieved.
ja: プログラムによっては、独自のステータスバーやMSコモンコントロールの特別なバージョンを使用しているものもあり、その場合はテキストを取得することができない。

source: Some programs will appear to return immediately even though they are still running; these programs spawn another process.
ja: プログラムによっては、まだ実行中であるにもかかわらず、すぐに戻ってくるように見えるものがありますが、これは別のプロセスを生成するものです。

source: Some special variables are not updated periodically, but rather their value is retrieved or calculated whenever the script references the variable.
ja: 特殊な変数の中には、定期的に更新されるのではなく、スクリプトがその変数を参照するたびに、その値が取得または計算されるものがあります。

source: Some testing on Windows 10 indicated that it had no effect on anything; calls to SetForegroundWindow always failed, and other workarounds employed by WinActivate were needed and effective regardless of timeout.
ja: Windows10でテストしたところ、何の効果もないことがわかりました。SetForegroundWindowの呼び出しは常に失敗し、WinActivateが採用する他の回避策は必要で、タイムアウトに関係なく有効でした。

source: Some unary and binary operators share the same symbols, in which case the meaning of the operator depends on whether it is written before, after or in between two values.
ja: 単項演算子と二項演算子には同じ記号を持つものがあり、その場合、演算子の意味は2つの値の前、後、間のいずれに書かれるかに依存します。

source: Some values, such as zero VK with non-zero SC, may fail to suppress the Start menu.
ja: VKがゼロでSCがゼロでないなど、一部の値ではスタートメニューの抑制に失敗することがあります。

source: Some variables such as A_KeyDelay and A_TitleMatchMode represent settings that control the script's behavior, and retain separate values for each thread.
ja: A_KeyDelayや A_TitleMatchModeなどの一部の変数は、スクリプトの動作を制御する設定を表し、各スレッドで別々の値を保持します。

source: Some ways that objects are used include:
ja: オブジェクトの使われ方としては、以下のようなものがあります：

source: Some windows refuse to be automated (e.g. Device Manager ignores Send).
ja: 自動化を拒否するウィンドウがあります（例：デバイスマネージャが送信を無視します）。

source: Sometime you might want a hotkey or hotstring to only work (or be disabled) in a certain window.
ja: ホットキーやホットストリングを特定のウィンドウでのみ使用したい（または無効にしたい）場合があります。

source: Sometimes a user may increase the DPI setting just to make content larger and more comfortable to read.
ja: コンテンツをより大きく快適に読むために、DPI設定を大きくすることがある。

source: Sometimes games have a hack and cheat prevention measure, such as GameGuard and Hackshield.
ja: ゲームにはGameGuardやHackshieldといったハックやチート防止対策が施されていることがあります。

source: Sometimes parameters are accepted when retrieving or assigning properties:
ja: プロパティの取得や割り当ての際にパラメータを受け付けることがある：

source: Sometimes system policies or other factors prevent the files from being extracted or executed.
ja: システムポリシーなどにより、ファイルの展開や実行ができないことがあります。

source: Sometimes testing code is easier if you assign it to a hotkey first.
ja: 最初にホットキーに割り当てておくと、コードのテストが楽になることがあります。

source: Sometimes the download might be blocked due to an antivirus false-positive; in that case, see Antivirus below.
ja: アンチウイルスの誤検知により、ダウンロードがブロックされる場合があります。その場合は、以下の「アンチウイルス」をご覧ください。

source: Sometimes these options are overridden by settings in the current user's profile, such as if Open With has been used to change the default program for opening .ahk files.
ja: 例えば、Open Withを使用して.ahkファイルを開くためのデフォルトプログラムを変更した場合など、これらのオプションは現在のユーザーのプロファイルの設定によって上書きされることがあります。

source: Sometimes to get the result you want, you will need to not only try different methods but also tweak the timing.
ja: 時には、望む結果を得るために、さまざまな方法を試すだけでなく、タイミングを微調整することも必要です。

source: Sometimes what you want is to send some keys in combination with other modifiers that were previously pressed or sent.
ja: あるキーを、以前に押したり送ったりした他のモディファイアと組み合わせて送りたいことがあります。

source: Sometimes you can get away with sending a flood of keystrokes faster than humanly possible, and sometimes you can't.
ja: 人並み以上の速さでキー入力の洪水を送っても大丈夫な場合もあれば、そうでない場合もあります。

source: Sometimes you want to have the user to choose the value of stuff.
ja: 時には、ユーザーが物の価値を選べるようにしたい。

source: Somewhere near the bottom are the key-down and key-up events for your key.
ja: 下の方に、キーのキーダウンイベントとキーアップイベントがあります。

source: Sort - Syntax & Usage | AutoHotkey v2
ja: Sort - 構文と使用法｜AutoHotkey v2

source: Sorting options:
ja: ソートオプション：

source: Sorting performance for Float and Text columns is up to 25 times slower than it is for integers.
ja: FloatとTextカラムのソート性能は、整数の場合と比べて最大25倍遅くなります。

source: Sorts a comma-separated list of numbers.
ja: コンマで区切られた数値のリストをソートする。

source: Sorts items based on character position n (do not use hexadecimal for n).
ja: 文字位置nに基づいて項目をソートする（nには 16 進数を使用しない）。

source: Sorts the contents of a file.
ja: ファイルの内容をソートする。

source: Sorts the items in the drop-list alphabetically.
ja: ドロップリストの項目をアルファベット順に並べ替えます。

source: Sorts the items in the list box alphabetically.
ja: リストボックスの項目をアルファベット順に並べ替えます。

source: Sound Functions
ja: Sound関数

source: Sound Functions | AutoHotkey v2
ja: Sound関数｜AutoHotkey v2

source: SoundBeep - Syntax & Usage | AutoHotkey v2
ja: SoundBeep - 構文と使用法｜AutoHotkey v2

source: SoundGet and SoundSet have been revised to better match the capabilities of the Vista+ sound APIs, dropping support for XP.
ja: SoundGetとSoundSetは、Vista+のサウンドAPIの機能によりマッチするように改訂され、XPのサポートを取りやめました。

source: SoundGet/SoundSet (see Sound functions)
ja: SoundGet/SoundSet（Sound関数参照）

source: SoundGetInterface - Syntax & Usage | AutoHotkey v2
ja: SoundGetInterface - 構文と使用法｜AutoHotkey v2

source: SoundGetMute - Syntax & Usage | AutoHotkey v2
ja: SoundGetMute - 構文と使用法｜AutoHotkey v2

source: SoundGetName - Syntax & Usage | AutoHotkey v2
ja: SoundGetName - 構文と使用法｜AutoHotkey v2

source: SoundGetVolume - Syntax & Usage | AutoHotkey v2
ja: SoundGetVolume - 構文と使用法｜AutoHotkey v2

source: SoundGetWaveVolume/SoundSetWaveVolume (slightly different behaviour to SoundGet/SoundSet regarding balance, but neither one preserves balance)
ja: SoundGetWaveVolume/SoundSetWaveVolume（バランスに関してSoundGet/SoundSetと若干異なる動作をするが、どちらもバランスは保たれない）

source: SoundPlay - Syntax & Usage | AutoHotkey v2
ja: SoundPlay - 構文と使用法｜AutoHotkey v2

source: SoundSetMute - Syntax & Usage | AutoHotkey v2
ja: SoundSetMute - 構文と使用法｜AutoHotkey v2

source: SoundSetVolume - Syntax & Usage | AutoHotkey v2
ja: SoundSetVolume - 構文と使用法｜AutoHotkey v2

source: SoundSetVolume attempts to preserve the existing balance when changing the volume level.
ja: SoundSetVolumeは、音量レベルを変更する際、既存のバランスを維持しようとします。

source: Soundcard Analysis.
ja: サウンドカードの分析。

source: Sources of such addresses include COM and CallbackCreate.
ja: このようなアドレスのソースには、COMと CallbackCreateがあります。

source: Spaces and tabs are generally ignored at the end of a line and within an expression (except between quotes).
ja: スペースとタブは、行末と式内では通常無視されます（引用符の間を除く）。

source: Spaces and tabs are treated literally within hotstring definitions.
ja: スペースとタブは、ホットストリング定義内で文字通り扱われます。

source: Spaces and tabs can be trimmed from both ends of any variable by using Trim.
ja: スペースやタブは、Trimを使うことで変数の両端から切り取ることができる。

source: Spaces are required when performing concatenation.
ja: 連結を行う場合は、空白が必要です。

source: Spaces may be required between two operators, to remove ambiguity.
ja: 曖昧さをなくすため、2つの演算子の間に空白が必要な場合があります。

source: Special CLSID folders may be opened via Run.
ja: 特殊なCLSIDフォルダは、「ファイル名を指定して実行」で開くことができます。

source: Special Characters
ja: 特殊文字

source: Special Characters:
ja: 特殊文字：

source: Special Characters: A_Space, A_Tab
ja: 特殊文字：A_Space、A_Tab

source: Special Variables Available Inside a File Loop
ja: ファイルループ内で使用できる特殊な変数

source: Special Variables Available Inside a File-Loop
ja: ファイルループ内で使用できる特殊な変数

source: Special hotkeys that are substitutes for alt-tab always ignore the tilde prefix.
ja: alt-tabの代用となる特殊なホットキーは、常にチルデの接頭辞を無視します。
